In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [4]:
df.nunique()

Survived                     2
Pclass                       3
Name                       887
Sex                          2
Age                         89
Siblings/Spouses Aboard      7
Parents/Children Aboard      7
Fare                       248
dtype: int64

In [5]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [6]:
df["Sex"] = df["Sex"].astype("category")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: category(1), float64(2), int64(4), object(1)
memory usage: 49.6+ KB

In [8]:
df["Pclass"] = df["Pclass"].astype("category")

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: category(2), float64(2), int64(3), object(1)
memory usage: 43.7+ KB

In [10]:
df["Survived"] = df["Survived"].astype("category")

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    category
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: category(3), float64(2), int64(2), object(1)
memory usage: 37.7+ KB

In [12]:
df["Siblings/Spouses Aboard"] = df["Siblings/Spouses Aboard"].astype("category")

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    category
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 32.0+ KB

In [14]:
df["Parents/Children Aboard"] = df["Parents/Children Aboard"].astype("category")

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    category
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float64
dtypes: category(5), float64(2), object(1)
memory usage: 26.3+ KB

In [16]:
df["Age"] = df["Age"].astype("category")

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    category
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    category
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float64
dtypes: category(6), float64(1), object(1)
memory usage: 23.0+ KB

In [18]:
df["Fare"] = df["Fare"].astype("float32")

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    category
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    category
 4   Age                      887 non-null    category
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float32
dtypes: category(6), float32(1), object(1)
memory usage: 19.5+ KB

In [20]:
df["Sex"] = df["Sex"].astype("bool")

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    category
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    category
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float32
dtypes: bool(1), category(5), float32(1), object(1)
memory usage: 19.4+ KB

In [22]:
df["Survived"] = df["Survived"].astype("bool")

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    bool
 1   Pclass                   887 non-null    category
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    category
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float32
dtypes: bool(2), category(4), float32(1), object(1)
memory usage: 19.3+ KB

In [24]:
df["Pclass"] = df["Pclass"].astype("int8")

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    bool
 1   Pclass                   887 non-null    int8
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    category
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float32
dtypes: bool(2), category(3), float32(1), int8(1), object(1)
memory usage: 19.2+ KB

In [26]:
df["Age"] = df["Age"].astype("int8")

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    bool
 1   Pclass                   887 non-null    int8
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    int8
 5   Siblings/Spouses Aboard  887 non-null    category
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float32
dtypes: bool(2), category(2), float32(1), int8(2), object(1)
memory usage: 16.4+ KB

In [28]:
df["Siblings/Spouses Aboard"] = df["Siblings/Spouses Aboard"].astype("int8")

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    bool
 1   Pclass                   887 non-null    int8
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    int8
 5   Siblings/Spouses Aboard  887 non-null    int8
 6   Parents/Children Aboard  887 non-null    category
 7   Fare                     887 non-null    float32
dtypes: bool(2), category(1), float32(1), int8(3), object(1)
memory usage: 16.1+ KB

In [30]:
df["Parents/Children Aboard"] = df["Parents/Children Aboard"].astype("int8")

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    bool
 1   Pclass                   887 non-null    int8
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    int8
 5   Siblings/Spouses Aboard  887 non-null    int8
 6   Parents/Children Aboard  887 non-null    int8
 7   Fare                     887 non-null    float32
dtypes: bool(2), float32(1), int8(4), object(1)
memory usage: 15.7+ KB

In [35]:
df["Fare"] = df["Fare"].astype("float16")

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    bool
 1   Pclass                   887 non-null    int8
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    bool
 4   Age                      887 non-null    int8
 5   Siblings/Spouses Aboard  887 non-null    int8
 6   Parents/Children Aboard  887 non-null    int8
 7   Fare                     887 non-null    float16
dtypes: bool(2), float16(1), int8(4), object(1)
memory usage: 14.0+ KB

In [38]:
df.describe()

,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000
mean,2.305524,29.455468,0.525366,0.383315,32.312500
std,0.836662,14.129919,1.104669,0.807466,49.781250
min,1.000000,0.000000,0.000000,0.000000,0.000000
25%,2.000000,20.000000,0.000000,0.000000,7.925781
50%,3.000000,28.000000,0.000000,0.000000,14.453125
75%,3.000000,38.000000,1.000000,0.000000,31.140625
max,3.000000,80.000000,8.000000,6.000000,512.500000

In [42]:
df.head(15)

C:\Users\Daniel\anaconda3\envs\AI-Accelerator\Lib\site-packages\pandas\io\formats\format.py:1458: RuntimeWarning: overflow encountered in cast
  has_large_values = (abs_vals > 1e6).any()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,False,3,Mr. Owen Harris Braund,True,22,1,0,7.250000
1,True,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,True,38,1,0,71.312500
2,True,3,Miss. Laina Heikkinen,True,26,0,0,7.925781
3,True,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,True,35,1,0,53.093750
4,False,3,Mr. William Henry Allen,True,35,0,0,8.046875
5,False,3,Mr. James Moran,True,27,0,0,8.460938
6,False,1,Mr. Timothy J McCarthy,True,54,0,0,51.875000
7,False,3,Master. Gosta Leonard Palsson,True,2,3,1,21.078125
8,True,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,True,27,0,2,11.132812
9,True,2,Mrs. Nicholas (Adele Achem) Nasser,True,14,1,0,30.078125
10,True,3,Miss. Marguerite Rut Sandstrom,True,4,1,1,16.703125
11,True,1,Miss. Elizabeth Bonnell,True,58,0,0,26.546875
12,False,3,Mr. William Henry Saundercock,True,20,0,0,8.046875
13,False,3,Mr. Anders Johan Andersson,True,39,1,5,31.281250
14,False,3,Miss. Hulda Amanda Adolfina Vestrom,True,14,0,0,7.855469